app/views/users/show.html.erb

<tbody>
    <% @user.posts.order('created_at DESC').each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? ORDER BY created_at DESC  [["user_id", 2]]

            <%= post.body%> <p>
            <%= "Likes: #{post.likes.count} "  %> <p>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 1]]