app/views/posts/show.html.erb

<div>
<p><%= @post.likes.count %> <%= (@post.likes.count) == 1 ? 'Like' : 'Likes'%></p>
<% pre_like = @post.likes.find { |like| like.user_id == current_user.id} %>
---
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 2]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 2]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

<h1>Comments</h1>
<% @post.comments.each do |comment|%>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 2]]