app/controllers/likes_controller.rb

    def find_like
        @like = @post.likes.find(params[:id])
---
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = ? AND "likes"."id" = ? LIMIT ?  [["post_id", 4], ["id", 2], ["LIMIT", 1]]

    def create
        if already_liked?
          flash[:notice] = "You can't like more than once"
        else
          @post.likes.create(user_id: current_user.id)
---
INSERT INTO "likes" ("created_at", "updated_at", "post_id", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2023-04-15 19:49:59.774301"], ["updated_at", "2023-04-15 19:49:59.774301"], ["post_id", 4], ["user_id", 3]]

    def already_liked?
        Like.where(user_id: current_user.id, post_id:
        params[:post_id]).exists?
---
SELECT 1 AS one FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 3], ["post_id", 4], ["LIMIT", 1]]

    def destroy
        if already_liked?
        @like.destroy
---
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 5]]