app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "author", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "test Post"], ["author", "User1"], ["body", "test text"], ["created_at", "2023-04-02 17:44:04.276165"], ["updated_at", "2023-04-02 17:44:04.276165"], ["user_id", 1]]
---
    def create
        @post = current_user.posts.build(post_params)
        @post.author = current_user.name
        if @post.save

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 3]]
---
    def destroy
        @post = Post.destroy(params[:id])