app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (lower(name) LIKE '%1%')
---
  def search
    if params[:search].blank?
      @results = User.all

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "follows" ("follower_id", "followee_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 3], ["followee_id", 2], ["created_at", "2023-04-05 06:36:10.896560"], ["updated_at", "2023-04-05 06:36:10.896560"]]
---
  def follow
    @user = User.find(params[:id])
    if current_user.following?(@user)
      flash[:alert] = "You are already following this user."
      redirect_to user_path(@user)
    else
      current_user.followees << @user

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "follows" WHERE "follows"."id" = ?  [["id", 1]]
---
  def unfollow
    @user = User.find(params[:id])
    if !(current_user.following?(@user))
      flash[:notice] = "Cannot unfollow"
      redirect_to user_path(@user)
    else
      current_user.followed_users.find_by(followee_id: @user.id).destroy

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def subscribes
    @user = User.find(params[:id])